<a href="https://colab.research.google.com/github/cinngyang/Python/blob/master/SampleCode/Pandas_%E6%95%B4%E7%90%86.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

# Pandas 基本資料結構
+ Series: index & value 可以用 dict to series 
+ DataFrame :  dict to DataFrame
+ 重新安排欄位順序 
  + frame=pd.DataFrame(data,columns=['year','state','pop'])
+ del 刪除欄
  + del frame['eastern']
+ dic 巢狀結構轉 DataFrame
+ dataFrame 轉置(欄列對調)
+ Index 物件
 + 重作索引(重排 Index 對應不到會設定 NaN) Series
 + 重作索引 DataFrame 可以對 列或欄或是兩者
 + frame.reindex(index=['a','c','d','e']) , frame=frame.reindex(columns=['Texas','Utah','California'])

In [32]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002,2003],
      'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data,columns=['year','state','pop'])
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [33]:
pop={'Nevada':{2001:2.4,2002:2.9},
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame2=pd.DataFrame(pop)
frame2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

# DataFrame 轉置

In [34]:
frame2.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

# Reindex
+ 重作索引(重排 Index 對應不到會設定 NaN) Series
+ 重作索引 DataFrame 可以對 列或欄或是兩者, 欄列重新排序
+ reindex 參數 method 填值

In [35]:
obj=pd.Series(range(3),index=['a','b','c'])
obj=obj.reindex(['a','b','c','d','e'],method='ffill')
obj

a    0
b    1
c    2
d    2
e    2
dtype: int64

In [36]:
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [37]:
states=['Texas','Utah','California']
frame=frame.reindex(index=['a','c','d','e'])
frame=frame.reindex(columns=states)
frame.index.name='rowIdx'
frame

        Texas  Utah  California
rowIdx
a         1.0   NaN         2.0
c         4.0   NaN         5.0
d         7.0   NaN         8.0
e         NaN   NaN         NaN

In [38]:
frame2=frame.loc[['a','d','c','e'],states]
frame2

        Texas  Utah  California
rowIdx
a         1.0   NaN         2.0
d         7.0   NaN         8.0
c         4.0   NaN         5.0
e         NaN   NaN         NaN

# 指定軸(index)刪除資料
+ 刪除欄 axis=1 , axis=colimns
+ 刪除列 dorp(rowIdx)

In [39]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
      index=['Ohio','Colorado','Utah','New York'],
      columns=['one','two','three','four'])
data.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# 索引選擇與過濾
+ 切片與選擇過濾資料
  + data[data['three'] > 5] , 所有滿足資料,無法指定少數欄 
  + data.loc[row,columns] 選取特欄或列
  + data.iloc[:,:3][data.three > 5]

In [40]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
      index=['Ohio','Colorado','Utah','New York'],
      columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [41]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [42]:
data
data.loc[:'New York'][data.three > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [43]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

# DataFrame 運算 Index 缺失自動填值
+ df1.Add(df2,fill_val=0)
+ df1.reindex(columns=df2.columns,fill_val=0)

# 逐列或逐欄套用含式
+ frame.apply(f) 整欄計算
+ frame.apply(f,axis='columns') 整欄計算
+ frame.applymap(f) 對比一個資料

In [54]:
frame=pd.DataFrame(np.random.randn(4,3),columns=list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])
f=lambda x: x.max()-x.min()
frame

               b         d         e
Utah    0.261743  1.344292 -0.412407
Ohio   -0.402001 -1.212309  0.412029
Texas   0.012196  0.646718  0.535071
Oregon -0.015547 -0.091073 -1.630632

In [55]:
frame.apply(f)

b    0.663743
d    2.556602
e    2.165704
dtype: float64

In [56]:
frame.apply(f,axis='columns')

Utah      1.756699
Ohio      1.624338
Texas     0.634522
Oregon    1.615086
dtype: float64

In [61]:
f2=lambda x: '%.2f' %x
frame.applymap(f2)

            b      d      e
Utah     0.26   1.34  -0.41
Ohio    -0.40  -1.21   0.41
Texas    0.01   0.65   0.54
Oregon  -0.02  -0.09  -1.63

# 匯總與統計量
+ df.sum(axis='columns')

# Reference
+ [Pandas 基礎教學](https://oranwind.org/python-pandas-ji-chu-jiao-xue/) 
+ [Data Frame 常用屬性與方法](https://ithelp.ithome.com.tw/articles/10185922) 
+ [Python data analysis toolkit](http://pandas.pydata.org/pandas-docs/stable/)
+ [Comparison with SQL](http://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html)
+ [資料分析機器學習-資料取得](https://medium.com/@yehjames/%E8%B3%87%E6%96%99%E5%88%86%E6%9E%90-%E6%A9%9F%E5%99%A8%E5%AD%B8%E7%BF%92-%E7%AC%AC2-1%E8%AC%9B-%E5%A6%82%E4%BD%95%E7%8D%B2%E5%8F%96%E8%B3%87%E6%96%99-sklearn%E5%85%A7%E5%BB%BA%E8%B3%87%E6%96%99%E9%9B%86-baa8f027ed7b)
+ [Pandas 基礎操作-groupby](https://ithelp.ithome.com.tw/articles/10194852) 
+ [One line if-condition-assignment](https://stackoverflow.com/questions/7872838/one-line-if-condition-assignment)